Repository: developsessions/b-r-udp-broadcast
Catalog: Automation Studio/as/system/A0453/Texts/EventLog_AR.tmx
Source language: en
Languages: de

source: A PV offset and PV length that exceed the address range in the slave were specified in the command data table for the Write counter command.
de: In der Befehlsdaten-Tabelle wurde für den Befehl Schreibe Counter ein PV-Offset und eine PV-Länge angegeben, die den Adressbereich im Slave überschreitet.

source: A PV offset and PV length that exceed the address range in the slave were specified in the command data table for the Read counter command.
de: In der Befehlsdaten-Tabelle wurde für den Befehl Lese Counter ein PV-Offset und eine PV-Länge angegeben, die den Adressbereich im Slave überschreitet.

source: A PV offset and PV length that exceed the address range in the slave were specified in the command data table for the Write flag command.
de: In der Befehlsdaten-Tabelle wurde für den Befehl Schreibe Merker ein PV-Offset und eine PV-Länge angegeben, die den Adressbereich im Slave überschreitet.

source: A PV offset and PV length that exceed the address range in the slave were specified in the command data table for the Read flag command.
de: In der Befehlsdaten-Tabelle wurde für den Befehl Lese Merker ein PV-Offset und eine PV-Länge angegeben, die den Adressbereich im Slave überschreitet.

source: A PV offset and PV length that exceed the address range in the slave were specified in the command data table for the Write input command.
de: In der Befehlsdaten-Tabelle wurde für den Befehl Schreibe Eingang ein PV-Offset und eine PV-Länge angegeben, die den Adressbereich im Slave überschreitet.

source: A PV offset and PV length that exceed the address range in the slave were specified in the command data table for the Read input command.
de: In der Befehlsdaten-Tabelle wurde für den Befehl Lese Eingang ein PV-Offset und eine PV-Länge angegeben, die den Adressbereich im Slave überschreitet.

source: A PV offset and PV length that exceed the address range in the slave were specified in the command data table for the Write output command.
de: In der Befehlsdaten-Tabelle wurde für den Befehl Schreibe Ausgang ein PV-Offset und eine PV-Länge angegeben, die den Adressbereich im Slave überschreitet.

source: A PV offset and PV length that exceed the address range in the slave were specified in the command data table for the Read output command.
de: In der Befehlsdaten-Tabelle wurde für den Befehl Lese Ausgang ein PV-Offset und eine PV-Länge angegeben, die den Adressbereich im Slave überschreitet.

source: Invalid command in the command data table: Write flag (packed) is not supported by the DRV_mn library.
de: Ungültiger Befehl in Befehlsdaten-Tabelle: Schreibe Merker (gepackt) wird von der DRV_mn-Bibliothek nicht unterstützt.

source: Invalid command in the command data table: Read flag (packed) is not supported by the DRV_mn library.
de: Ungültiger Befehl in Befehlsdaten-Tabelle: Lese Merker (gepackt) wird von der DRV_mn-Bibliothek nicht unterstützt.

source: Invalid command in the command data table: Write input (packed) is not supported by the DRV_mn library.
de: Ungültiger Befehl in Befehlsdaten-Tabelle: Schreibe Eingang (gepackt) wird von der DRV_mn-Bibliothek nicht unterstützt.

source: Invalid command in the command data table: Read input (packed) is not supported by the DRV_mn library.
de: Ungültiger Befehl in Befehlsdaten-Tabelle: Lese Eingang (gepackt) wird von der DRV_mn-Bibliothek nicht unterstützt.

source: Invalid command in the command data table: Write output (packed) is not supported by the DRV_mn library.
de: Ungültiger Befehl in Befehlsdaten-Tabelle: Schreibe Ausgang (gepackt) wird von der DRV_mn-Bibliothek nicht unterstützt.

source: Invalid command in the command data table: Read output (packed) is not supported by the DRV_mn library.
de: Ungültiger Befehl in Befehlsdaten-Tabelle: Lese Ausgang (gepackt) wird von der DRV_mn-Bibliothek nicht unterstützt.

source: Incorrect access to hardware component (IRC)
de: Falscher Zugriff auf Hardwarekomponente (IRC)

source: Invalid command in the command data table.
de: Ungültiger Befehl in Befehlsdaten-Tabelle.

source: Fatal error! New command in command data table is unknown.
de: Fataler Fehler! Neuer Befehl in Befehlsdaten-Tabelle ist unbekannt.

source: Invalid index or invalid frame length in slave response to reset slave command.
de: Ungültiger Index bzw. ungültige Frame-Länge im Slave-Response auf den Befehl Reset Slave.

source: Invalid index in slave response. Index is not an error index and is not identical to the request index.
de: Ungültiger Index in der Slave-Response. Index ist keine Fehler-Index und nicht identisch mit dem Request-Index.

source: Invalid length of a response to a write command.
de: Ungültige Länge eines Response auf einen Schreib-Befehl.

source: Invalid length of a response to a read command.
de: Ungültige Länge eines Response auf einen Lese-Befehl.

source: Invalid value at ident input in the MNMclien() or MNSservr() FBKs.
de: Ungültiger Wert am Eingang ident des FUBs MNMclien() oder MNSservr().

source: Invalid value at ident input in the MNMclose() or MNSclose() FBKs.
de: Ungültiger Wert am Eingang ident des FUBs MNMclose() oder MNSclose().

source: Mode is not supported by IRC
de: Mode wird vom IRC nicht unterstützt

source: Invalid ident value when MNMopen() or MNSopen() is called again. Either provide a valid value or call MNMclose() or MNSclose() first.
de: Ungültiger ident-Wert bei nochmaligem Aufruf von MNMopen() bzw. MNSopen(). Entweder gültigen Wert übergeben, oder zuvor MNMclose() oder MNSclose() aufrufen.

source: No command data table attached to the vars input.
de: Am vars-Eingang wurde keine Befehlsdaten-Tabelle angeschlossen.

source: The enable flag name is longer than 81 characters.
de: Die Länge des Enable-Flag-Namens ist länger als 81 Zeichen.

source: The PV name is longer than 81 characters.
de: Die Länge des PV-Namens ist länger als 81 Zeichen.

source: The command data table contains no entries.
de: Die Befehlsdaten-Tabelle enthält keine Einträge.

source: The length of a null string (spaces) for an enable flag does not match the length of the enable flag name in the first entry of the command data table.
de: Die Länge eines Leer-Strings (Leerzeichen) für ein Enable-Flag ist nicht identisch mit der Länge des Enable-Flag-Namens im ersten Eintrag der Befehlsdaten-Tabelle.

source: The length of a name (including spaces where applicable) for an enable flag does not match the length of the enable flag name in the first entry of the command data table.
de: Die Länge eines Namens (evt. inkl. Leerzeichen) für ein Enable-Flag ist nicht identisch mit der Länge des Enable-Flag-Namens im ersten Eintrag der Befehlsdaten-Tabelle.

source: Incorrect interrupt number transmitted
de: Falsche Interruptnummer übergeben

source: The length of a PV name string does not match the string length of PV name in the first entry of the command data table.
de: Die Länge eines Strings PV-Name ist nicht identisch mit der String-Länge von PV-Name im ersten Eintrag der Befehlsdaten-Tabelle.

source: The length of an entry (command) does not match the length of the first entry in the command data table.
de: Die Länge eines Eintrags (Befehl) ist nicht identisch mit der Länge des ersten Eintrags in der Befehlsdaten-Tabelle.

source: Invalid data type for enable flag PV (BOOL or USINT).
de: Der Datentyp der Enable-Flag- PV ist ungültig (BOOL oder USINT).

source: Warning: No valid entries found in the command data table. Do the enable flag PV and PV name variables exist?
de: Warnung: In der Befehlsdaten-Tabelle wurde kein gültiger Eintrag gefunden. Existieren die Variablen Enable-Flag- PV und PV-Name?

source: Fatal error: Command data table has been modified. The string length for enable flag is no longer valid.
de: Fataler Fehler: Befehlsdaten-Tabelle wurde verändert. Die String-Länge für Enable-Flag ist nicht länger gültig.

source: Master initialization error - fatal error: Command data table has been modified. The string length for PV name is no longer valid.
de: Fataler Fehler: Befehlsdaten-Tabelle wurde verändert. Die String-Länge für PV-Name ist nicht länger gültig.

source: Fatal error: Command data table has been modified. The string length for PV name is no longer valid.
de: Fataler Fehler: Befehlsdaten-Tabelle wurde verändert. Die String-Länge für PV-Name ist nicht länger gültig.

source: A valid command data table has not been initialized in the MNMopen() function.
de: In der Funktion MNMopen() wurde keine gültige Befehlsdaten-Tabelle initialisiert.

source: Invalid node number! (higher or lower order nibble has the value 0)
de: Ungültige Knotennummer! (höher- bzw. niederwertiges Nibble hat den Wert 0)

source: Warning: No MININET slave variables found (MNS_xxx variables).
de: Warnung: Keine MININET Slave-Variablen gefunden (MNS_xxx-Variablen).

source: Incorrect call by IRC-Routine
de: Fehlerhafter Aufruf bei IRC-Routine

source: Incorrect mode for IRC_setvector
de: Falscher Mode bei IRC_setvector

source: Index 0xC1: Index error.
de: Index 0xC1: Index-Fehler.

source: Index 0xC2: Conflict between index and command.
de: Index 0xC2: Konflikt zwischen Index und Befehl.

source: Index 0xC3: Invalid parameter.
de: Index 0xC3: Ungültiger Parameter.

source: Index 0xC4: Unknown command.
de: Index 0xC4: Unbekannter Befehl.

source: Index 0xC8: Command already executed.
de: Index 0xC8: Befehl wurde bereits ausgeführt.

source: Incorrect vector for IRC_setvector
de: Falscher Vector bei IRC_setvector

source: ENABLE for IRC_setvector not allowed in this mode
de: ENABLE bei IRC_setvector mit diesem Mode nicht zulässig

source: Too many IRQ context handlers
de: Zuviele IRQ-Kontexthandler

source: Connection identifier cident invalid
de: Connection-Identifier cident ungültig.

source: Default IRQ context handler
de: Default-IRQ-Kontexthandler

source: Error during watchdog activation
de: Fehler bei der Aktivierung des Watchdogs

source: An argument is invalid
de: Ungültiges Argument

source: Connection lost
de: Die Verbindung wurde unterbrochen.

source: No input available.
de: Kein Input vorhanden.

source: Connection has been established.
de: Die Verbindung wird gerade aufgebaut.

source: The socket is non-blocking and a previous connection attempt has not yet completed.
de: Der Socket ist asynchron und ein früherer Versuch eine Verbindung aufzubauen, ist noch nicht abgeschlossen.

source: Destination Adresse ungültig
de: Zieladresse ist ungültig

source: Target address of receiver (IP address, port) is invalid.
de: Die Ziel-Adresse des Empfängers (IP-Adresse, Port) ist ungültig.

source: Message too long. Data cannot be transferred in one unit.
de: Die Nachricht ist zu lang. Die Daten können nicht in einer Einheit transportiert werden.

source: The specified address is already in use.
de: Die spezifizierte Adresse wird bereits verwendet.

source: The specified address is not available.
de: Die angegebene Adresse ist nicht verfügbar.

source: The target network cannot be accessed.
de: Das Zielnetzwerk kann nicht erreicht werden.

source: No more internal pNA buffers available.
de: Kein interner pNA-Buffer mehr verfügbar.

source: No inititialization for IRQ context
de: Keine Inititialisierung für IRQ-Kontext

source: Incorrect access to hardware component (DIS)
de: Warnung: Falscher Zugriff auf Hardwarekomponente (DIS)

source: Wrong parameter given (NULL pointer)
de: Falscher Parameter übergeben (NULL-Pointer)

source: Object already present
de: Objekt schon vorhanden

source: Wrong target memory specified
de: Falscher Zielspeicher angegeben

source: No memory available for module to be created
de: Kein Speicher für zu erzeugendes Modul verfügbar

source: Error installing data object
de: Fehler beim Installieren des Datenobjektes

source: Object not found
de: Objekt nicht gefunden

source: Wrong object type (not data object)
de: Falscher Objekttyp (kein Datenobjekt)

source: Wrong offset specified
de: Falscher Offset angegeben

source: Wrong length specified
de: Falsche Länge angegeben

source: Data object not found.
de: Datenobjekt nicht gefunden

source: Invalid row entry
de: Warnung: Falsche Zeilennummer beim Display (2010)

source: Wrong date in SetDate (DatObjChangeDate)
de: Falsches Datum bei SetDate (DatObjChangeDate)

source: Incorrect state of the data object
de: Falscher State des Datenobjektes

source: Error activating the asynchronous handler (only SG4)
de: Fehler beim Aktivieren des asynchronen Handlers (nur SG4)

source: Module name too long (max. 10 characters) or contains invalid character.
de: Modulname zu lange (max. 10 Zeichen) oder ungültige Zeichen im Modulnamen.

source: Error while saving the data object in "Flash" memory
de: Fehler beim Speichern des Datenobjektes in einen "Flash"-Speicher

source: Cannot delete module in SYSROM
de: Modul im SYSROM kann nicht gelöscht werden

source: Invalid column entry
de: Warnung: Falsche Spaltennummer beim Display (2010)

source: Invalid ASCII character
de: Warnung: Ungültige Zeichennummer bei Display (2010)

source: Wrong target memory specified for the "doNO_CS" option
de: Falscher Zielspeicher für die Option "doNO_CS" angegeben.

source: Incorrect access to display (2010)
de: Warnung: Falscher Zugriff auf Display (2010)

source: Incorrect access to hardware component (RTC)
de: Warnung: Falscher Zugriff auf Hardwarekomponente (RTC)

source: Invalid path
de: Ungültiger Pfad

source: Data length specified too small
de: Angegebene Datenlänge ist zu klein

source: End of a directory reached / too many open files
de: Ende eines Verzeichnisses erreicht / zu viele offene Dateien

source: System error
de: Der FUB bzw. die verwendeten Parameter werden für das angegebene Filedevice nicht unterstützt

source: Invalid type.
de: Ungültiger Typ

source: File or directory already exists.
de: Datei oder Verzeichnis existiert bereits

source: Access denied
de: Zugriffsverweigerung

source: Illegal mode.
de: Unzulässiger Mode

source: File does not exist.
de: Datei nicht vorhanden

source: pDevice is too long or NULL, unsupported file system or the root directory is full (FAT file system) or the device is write-protected
de: pDevice ist zu lang oder NULL, nicht unterstütztes Filesystem oder root Verzeichnis ist voll (FAT Filesystem) oder der Datenträger ist schreibgeschützt

source: Incorrect time when setting RTC.
de: Warnung: Falsche Zeit bei RTC setzen.

source: No memory available
de: Kein Speicher

source: Invalid file offset.
de: Ungültiger Fileoffset

source: File not allowed.
de: Datei nicht zulässig

source: General error in FileOpen.
de: Allgemeiner Fehler aus FileOpen

source: General error in FileClose.
de: Allgemeiner Fehler aus FileClose

source: General error in FileRead.
de: Allgemeiner Fehler aus FileRead

source: General error in FileWrite.
de: Allgemeiner Fehler aus FileWrite

source: General error in Ioctl.
de: Allgemeiner Fehler aus Ioctl

source: Data parameter error
de: Data-Parameter Fehler

source: RTC does not support Hold function
de: Warnung: RTC unterstützt keine Holdfunktion

source: Error in the FileIO manager.
de: Fehler im FileIoManager

source: File not open.
de: Datei nicht geöffnet

source: Invalid directory.
de: Ungültiges Verzeichnis

source: Directory does not exist.
de: Verzeichnis existiert nicht

source: Directory not empty.
de: Verzeichnis ist nicht leer

source: Directory or file already exists.
de: Verzeichnis oder Datei existiert bereits

source: Error retrieving memory information.
de: Fehler bei der Speicherermittlung

source: Copy memory error
de: Copy-Speicher Fehler

source: No Idents directory available.
de: Keine Verzeichnis Idents mehr vorhanden.

source: Invalid parameter specified.
de: Ungültige Parameterangabe.

source: RTC not initialized
de: Warnung: RTC nicht initialisiert

source: Directory already exists.
de: Device existiert bereits.

source: The specified handle is invalid.
de: Der angegebene Handle ist ungültig.

source: Another IP address has already been defined for a host name, i.e. the DNS server supplies another IP address.
de: Für einen Hostnamen ist bereits eine andere IP-Adresse definiert worden, bzw. der DNS-Server liefert eine andere IP-Adresse.

source: Invalid parameter
de: Ungültiger Parameter

source: Invalid user name or password
de: Ungültiger Benutzer bzw. Passwort

source: Invalid number of bytes.
de: Ungültige Anzahl von Bytes

source: WARNING: No RTC RAM image
de: Warnung: Kein RTC-RAM-Abbild

source: WARNING: Time / date changed
de: Warnung: Zeit/Datum geändert

source: Could not initialize library.
de: Fehler beim Initialisieren der Bibliothek

source: Error in device driver.
de: Fehler im DeviceDriver

source: Error in device manager.
de: Fehler im DeviceManager

source: POWERLINK: Base error AC112.
de: POWERLINK: Basis Fehler AC112.

source: POWERLINK: Station failure
de: POWERLINK: Stationsausfall

source: POWERLINK: General error for local interface.
de: POWERLINK: Allgemeiner Fehler für lokale Schnittstelle.

source: POWERLINK: Cycle time violation (see info or binary data for actual time)
de: POWERLINK: Zykluszeitverletzung (siehe Info bzw. Binary data für tatsächliche Zeit)

source: POWERLINK: Specific Controlled Node error
de: POWERLINK: Spezifischer Controlled Node Fehler

source: POWERLINK: Station recognized as active
de: POWERLINK: Station als aktiv erkannt

source: POWERLINK: Node number used several times (info or binary data specifies node number).
de: POWERLINK: Knotennummer wurde mehrfach vergeben (Info bzw. Binary data gibt Knotennummer an)

source: POWERLINK: Base error EX282
de: POWERLINK: Basis Fehler EX282

source: POWERLINK: Different cycle time configured on the Controlled Node than on the Managing Node.
de: POWERLINK: Am Controlled Node wurde eine andere Zykluszeit als am Managing Node konfiguriert

source: POWERLINK: A Controlled Node is cyclically addressed by more than one Managing Node.
de: POWERLINK: Ein Controlled Node wird von mehr als einem Managing Node zyklisch angesprochen

source: POWERLINK: A fatal error has occurred.
de: POWERLINK: Ein fataler Fehler ist aufgetreten.

source: Incorrect access to hardware component (DMA)
de: Falscher Zugriff auf Hardwarekomponente (DMA)

source: Powerlnk library: Version conflict in system structures
de: Library Powerlnk: Versionskonflikt in Systemstrukturen

source: Powerlnk library: Error reserving memory
de: Library Powerlnk: Fehler beim reservieren von Speicher

source: Powerlnk library: Incorrect hardware device
de: Library Powerlnk: Falsches Hardware Device

source: Powerlnk library: Configuration was not found
de: Library Powerlnk: Konfiguration wurde nicht gefunden

source: Powerlnk library: Configuration already carried out
de: Library Powerlnk: Konfiguration wurde bereits durchgeführt

source: Powerlnk library: Desired function is not supported
de: Library Powerlnk: Gewünsche Funktion wird nicht unterstützt

source: Powerlnk library: Invalid parameter given to the function
de: Library Powerlnk: Ungültige Parameter an Funktion übergeben

source: Powerlnk library: Incorrect or invalid Ident given
de: Library Powerlnk: Falscher oder ungültiger Ident übergeben

source: Powerlnk library: Station allocation failed
de: Library Powerlnk: Anlegen der Station fehlgeschlagen

source: Powerlnk library: Creating a non-cyclic communication channel failed
de: Library Powerlnk: Anlegen eines azyklischen Kommunikationskanals fehlgeschlagen

source: Powerlnk library: Reserving the buffer failed
de: Library Powerlnk: Reservieren des Buffers fehlgeschlagen

source: Powerlnk library: Non-cyclic communication channel is already open.
de: Library Powerlnk: Azyklischer Kommunikationskanal ist bereits geöffnet

source: Powerlnk library: No frame ready to be called.
de: Library Powerlnk: Es ist noch kein Frame zur Abholung bereit

source: Powerlnk library: The frame to be sent is larger than the buffer used to transfer it
de: Library Powerlnk: Zur Abholung bereit liegender Frame ist größer als der übergebene Buffer

source: Powerlnk library: Previous plAcycWrite() on this channel has not yet been completed.
de: Library Powerlnk: Vorhergehender plAcycWrite() auf diesen Kanal wurde noch nicht abgeschlossen.

source: Powerlnk library: Offset too large for the copy instruction
de: Library Powerlnk: Offset für Kopierauftrag ist zu groß

source: Powerlnk library: NIL pointer given as a parameter
de: Library Powerlnk: NIL-Pointer als Parameter übergeben

source: Powerlnk library: Buffer overflow
de: Library Powerlnk: Überlauf in Buffer

source: Powerlnk library: Data point not available
de: Library Powerlnk: Datenpunkt ist nicht verfügbar

source: Powerlnk library: Incorrect task class
de: Library Powerlnk: Falsche Taskklasse

source: Powerlnk library: Station not active
de: Library Powerlnk: Station nicht aktiv

source: Powerlnk library: Too many POWERLINK interfaces are configured
de: Library Powerlnk: Zu viele POWERLINK-Schnittstellen konfiguriert

source: Powerlnk library: Bus number configured twice
de: Library Powerlnk: Busnummer doppelt vergeben

source: Powerlnk library: Synchronization must take place using the system configuration (beginning with AS 2.2).
de: Library Powerlnk: Synchronisierung muss über die Systemkonfiguration erfolgen (ab AS 2.2)

source: Powerlnk library: Synchronizing the task class system failed.
de: Library Powerlnk: Synchronisierung des Taskklassensystems fehlgeschlagen.

source: Powerlnk library: Conflict in the POWERLINK configuration
de: Library Powerlnk: Konflikt in der POWERLINK-Konfiguration

source: Powerlnk library: The specified data point is not in the station's poll response frame and can therefore not be heard.
de: Library Powerlnk: Der angegebene Datenpunkt ist nicht im Poll-Response-Frame der Station und kann daher nicht mitgehört werden.

source: Powerlnk library: Data type of object not supported
de: Powerlnk library: Datentyp des Objekts wird nicht unterstützt

source: Powerlnk library: No PDO mapping defined
de: Powerlnk Library: Kein PDO-Mapping definiert

source: Powerlnk library: Entry of hardware information not supported
de: Powerlnk Library: Eintragen von Hardwareinformationen nicht unterstützt

source: Powerlnk library: POWERLINK interface started via task class
de: Powerlnk Library: POWERLINK Schnittstelle wird über Taskklasse gestartet

source: POWERLINK: DMA transfer of output data finished too late
de: POWERLINK: DMA-Übertragung der Output-Daten wurde spät fertig

source: Library Powerlnk: Delayed initialization of node number not possible since iCN already initialized.
de: Powerlnk Bibliothek: Verzögerte Initialisierung der Knotennummer nicht möglich, da iCNbereits initialisiert.

source: Library Powerlnk: (Uninitialized) data of iCN with delayed initialization queried.
de: Powerlnk Bibliothek: Es werden (nicht initialisierte) Daten eines verzögert initialisierten iCN abgefragt.

source: No response from 2003 module
de: POWERLINK: Keine Antwort vom 2003 - Modul

source: Addressed 2003 module removed
de: POWERLINK: Angesprochenes 2003 - Modul wurde entfernt

source: 2003 I/O module not present
de: POWERLINK: 2003 - IO-Modul existiert nicht

source: Powerlnk library: Error while parsing the data point or channel definition
de: Library Powerlnk: Fehler beim Parsen der Datenpunkt- oder Kanalbeschreibung

source: Powerlnk library: Data point definition continues past an expected end
de: Library Powerlnk: Datenpunktbeschreibung geht nach erwartetem Ende noch weiter

source: Powerlnk library: No % in expected position in the data point description
de: Library Powerlnk: Kein % an erwarteter Position in der Datenpunktbeschreibung

source: Powerlnk library: Direction specification in the data point definition is neither IN (I) nor OUT (Q)
de: Library Powerlnk: Richtungsangabe in Datenpunktbeschreibung ist weder IN (I) noch OUT (Q)
